avrdudes/avr-libc/include/avr/ioavr16dd20.h
/* Crystal startup time select bit group configurations*/
typedef enum CLKCTRL_CSUT_enum
{
    CLKCTRL_CSUT_1K_gc             = (CLKCTRL_CSUT_1K_gv << CLKCTRL_CSUT_gp),  /* 1k cycles */
    CLKCTRL_CSUT_16K_gc            = (CLKCTRL_CSUT_16K_gv << CLKCTRL_CSUT_gp),  /* 16k cycles */
    CLKCTRL_CSUT_32K_gc            = (CLKCTRL_CSUT_32K_gv << CLKCTRL_CSUT_gp),  /* 32k cycles */
    CLKCTRL_CSUT_64K_gc            = (CLKCTRL_CSUT_64K_gv << CLKCTRL_CSUT_gp)   /* 64k cycles */
} CLKCTRL_CSUT_t;

/* Start-up Time Select bit group values */
typedef enum CLKCTRL_CSUTHF_VALUES_enum
{
    CLKCTRL_CSUTHF_256_gv          = 0x00,  /* 256 XOSCHF cycles */
    CLKCTRL_CSUTHF_1K_gv           = 0x01,  /* 1K XOSCHF cycles */
    CLKCTRL_CSUTHF_4K_gv           = 0x02   /* 4K XOSCHF cycles */
} CLKCTRL_CSUTHF_values_t;

/* Start-up Time Select bit group configurations*/
typedef enum CLKCTRL_CSUTHF_enum
{
    CLKCTRL_CSUTHF_256_gc          = (CLKCTRL_CSUTHF_256_gv << CLKCTRL_CSUTHF_gp),  /* 256 XOSCHF cycles */
    CLKCTRL_CSUTHF_1K_gc           = (CLKCTRL_CSUTHF_1K_gv << CLKCTRL_CSUTHF_gp),  /* 1K XOSCHF cycles */
    CLKCTRL_CSUTHF_4K_gc           = (CLKCTRL_CSUTHF_4K_gv << CLKCTRL_CSUTHF_gp)   /* 4K XOSCHF cycles */
} CLKCTRL_CSUTHF_t;

/* Frequency Range select bit group values */
typedef enum CLKCTRL_FRQRANGE_VALUES_enum
{
    CLKCTRL_FRQRANGE_8M_gv         = 0x00,  /* Max 8 MHz XTAL Frequency */
    CLKCTRL_FRQRANGE_16M_gv        = 0x01,  /* Max 16 MHz XTAL Frequency */
    CLKCTRL_FRQRANGE_24M_gv        = 0x02,  /* Max 24 MHz XTAL Frequency */
    CLKCTRL_FRQRANGE_32M_gv        = 0x03   /* Max 32 MHz XTAL Frequency */
} CLKCTRL_FRQRANGE_values_t;

/* Frequency Range select bit group configurations*/
typedef enum CLKCTRL_FRQRANGE_enum
{
    CLKCTRL_FRQRANGE_8M_gc         = (CLKCTRL_FRQRANGE_8M_gv << CLKCTRL_FRQRANGE_gp),  /* Max 8 MHz XTAL Frequency */
    CLKCTRL_FRQRANGE_16M_gc        = (CLKCTRL_FRQRANGE_16M_gv << CLKCTRL_FRQRANGE_gp),  /* Max 16 MHz XTAL Frequency */
    CLKCTRL_FRQRANGE_24M_gc        = (CLKCTRL_FRQRANGE_24M_gv << CLKCTRL_FRQRANGE_gp),  /* Max 24 MHz XTAL Frequency */
    CLKCTRL_FRQRANGE_32M_gc        = (CLKCTRL_FRQRANGE_32M_gv << CLKCTRL_FRQRANGE_gp)   /* Max 32 MHz XTAL Frequency */
} CLKCTRL_FRQRANGE_t;

/* Frequency select bit group values */
typedef enum CLKCTRL_FRQSEL_VALUES_enum
{
    CLKCTRL_FRQSEL_1M_gv           = 0x00,  /* 1 MHz system clock */
    CLKCTRL_FRQSEL_2M_gv           = 0x01,  /* 2 MHz system clock */
    CLKCTRL_FRQSEL_3M_gv           = 0x02,  /* 3 MHz system clock */
    CLKCTRL_FRQSEL_4M_gv           = 0x03,  /* 4 MHz system clock (default) */
    CLKCTRL_FRQSEL_8M_gv           = 0x05,  /* 8 MHz system clock */
    CLKCTRL_FRQSEL_12M_gv          = 0x06,  /* 12 MHz system clock */
    CLKCTRL_FRQSEL_16M_gv          = 0x07,  /* 16 MHz system clock */
    CLKCTRL_FRQSEL_20M_gv          = 0x08,  /* 20 MHz system clock */
    CLKCTRL_FRQSEL_24M_gv          = 0x09   /* 24 MHz system clock */
} CLKCTRL_FRQSEL_values_t;

/* Frequency select bit group configurations*/
typedef enum CLKCTRL_FRQSEL_enum
{
    CLKCTRL_FRQSEL_1M_gc           = (CLKCTRL_FRQSEL_1M_gv << CLKCTRL_FRQSEL_gp),  /* 1 MHz system clock */
    CLKCTRL_FRQSEL_2M_gc           = (CLKCTRL_FRQSEL_2M_gv << CLKCTRL_FRQSEL_gp),  /* 2 MHz system clock */
    CLKCTRL_FRQSEL_3M_gc           = (CLKCTRL_FRQSEL_3M_gv << CLKCTRL_FRQSEL_gp),  /* 3 MHz system clock */
    CLKCTRL_FRQSEL_4M_gc           = (CLKCTRL_FRQSEL_4M_gv << CLKCTRL_FRQSEL_gp),  /* 4 MHz system clock (default) */
    CLKCTRL_FRQSEL_8M_gc           = (CLKCTRL_FRQSEL_8M_gv << CLKCTRL_FRQSEL_gp),  /* 8 MHz system clock */
    CLKCTRL_FRQSEL_12M_gc          = (CLKCTRL_FRQSEL_12M_gv << CLKCTRL_FRQSEL_gp),  /* 12 MHz system clock */
    CLKCTRL_FRQSEL_16M_gc          = (CLKCTRL_FRQSEL_16M_gv << CLKCTRL_FRQSEL_gp),  /* 16 MHz system clock */
    CLKCTRL_FRQSEL_20M_gc          = (CLKCTRL_FRQSEL_20M_gv << CLKCTRL_FRQSEL_gp),  /* 20 MHz system clock */
    CLKCTRL_FRQSEL_24M_gc          = (CLKCTRL_FRQSEL_24M_gv << CLKCTRL_FRQSEL_gp)   /* 24 MHz system clock */
} CLKCTRL_FRQSEL_t;

/* Interrupt type select bit group values */
typedef enum CLKCTRL_INTTYPE_VALUES_enum
{
    CLKCTRL_INTTYPE_INT_gv         = 0x00,  /* Regular Interrupt */
    CLKCTRL_INTTYPE_NMI_gv         = 0x01   /* NMI */
} CLKCTRL_INTTYPE_values_t;

/* Interrupt type select bit group configurations*/
typedef enum CLKCTRL_INTTYPE_enum
{
    CLKCTRL_INTTYPE_INT_gc         = (CLKCTRL_INTTYPE_INT_gv << CLKCTRL_INTTYPE_bp),  /* Regular Interrupt */
    CLKCTRL_INTTYPE_NMI_gc         = (CLKCTRL_INTTYPE_NMI_gv << CLKCTRL_INTTYPE_bp)   /* NMI */
} CLKCTRL_INTTYPE_t;

/* Multiplication factor select bit group values */
typedef enum CLKCTRL_MULFAC_VALUES_enum
{
    CLKCTRL_MULFAC_DISABLE_gv      = 0x00,  /* PLL is disabled */
    CLKCTRL_MULFAC_2x_gv           = 0x01,  /* 2 x multiplication factor */
    CLKCTRL_MULFAC_3x_gv           = 0x02   /* 3 x multiplication factor */
} CLKCTRL_MULFAC_values_t;

/* Multiplication factor select bit group configurations*/
typedef enum CLKCTRL_MULFAC_enum
{
    CLKCTRL_MULFAC_DISABLE_gc      = (CLKCTRL_MULFAC_DISABLE_gv << CLKCTRL_MULFAC_gp),  /* PLL is disabled */
    CLKCTRL_MULFAC_2x_gc           = (CLKCTRL_MULFAC_2x_gv << CLKCTRL_MULFAC_gp),  /* 2 x multiplication factor */
    CLKCTRL_MULFAC_3x_gc           = (CLKCTRL_MULFAC_3x_gv << CLKCTRL_MULFAC_gp)   /* 3 x multiplication factor */
} CLKCTRL_MULFAC_t;

/* Prescaler division select bit group values */
typedef enum CLKCTRL_PDIV_VALUES_enum
{
    CLKCTRL_PDIV_2X_gv             = 0x00,  /* 2X */
    CLKCTRL_PDIV_4X_gv             = 0x01,  /* 4X */
    CLKCTRL_PDIV_8X_gv             = 0x02,  /* 8X */
    CLKCTRL_PDIV_16X_gv            = 0x03,  /* 16X */
    CLKCTRL_PDIV_32X_gv            = 0x04,  /* 32X */
    CLKCTRL_PDIV_64X_gv            = 0x05,  /* 64X */
    CLKCTRL_PDIV_6X_gv             = 0x08,  /* 6X */
    CLKCTRL_PDIV_10X_gv            = 0x09,  /* 10X */
    CLKCTRL_PDIV_12X_gv            = 0x0A,  /* 12X */
    CLKCTRL_PDIV_24X_gv            = 0x0B,  /* 24X */
    CLKCTRL_PDIV_48X_gv            = 0x0C   /* 48X */
} CLKCTRL_PDIV_values_t;

/* Prescaler division select bit group configurations*/
typedef enum CLKCTRL_PDIV_enum
{
    CLKCTRL_PDIV_2X_gc             = (CLKCTRL_PDIV_2X_gv << CLKCTRL_PDIV_gp),  /* 2X */
    CLKCTRL_PDIV_4X_gc             = (CLKCTRL_PDIV_4X_gv << CLKCTRL_PDIV_gp),  /* 4X */
    CLKCTRL_PDIV_8X_gc             = (CLKCTRL_PDIV_8X_gv << CLKCTRL_PDIV_gp),  /* 8X */
    CLKCTRL_PDIV_16X_gc            = (CLKCTRL_PDIV_16X_gv << CLKCTRL_PDIV_gp),  /* 16X */
    CLKCTRL_PDIV_32X_gc            = (CLKCTRL_PDIV_32X_gv << CLKCTRL_PDIV_gp),  /* 32X */
    CLKCTRL_PDIV_64X_gc            = (CLKCTRL_PDIV_64X_gv << CLKCTRL_PDIV_gp),  /* 64X */
    CLKCTRL_PDIV_6X_gc             = (CLKCTRL_PDIV_6X_gv << CLKCTRL_PDIV_gp),  /* 6X */
    CLKCTRL_PDIV_10X_gc            = (CLKCTRL_PDIV_10X_gv << CLKCTRL_PDIV_gp),  /* 10X */
    CLKCTRL_PDIV_12X_gc            = (CLKCTRL_PDIV_12X_gv << CLKCTRL_PDIV_gp),  /* 12X */
    CLKCTRL_PDIV_24X_gc            = (CLKCTRL_PDIV_24X_gv << CLKCTRL_PDIV_gp),  /* 24X */
    CLKCTRL_PDIV_48X_gc            = (CLKCTRL_PDIV_48X_gv << CLKCTRL_PDIV_gp)   /* 48X */
} CLKCTRL_PDIV_t;

/* External Source Select bit group values */
typedef enum CLKCTRL_SELHF_VALUES_enum
{
    CLKCTRL_SELHF_XTAL_gv          = 0x00,  /* External Crystal */
    CLKCTRL_SELHF_EXTCLOCK_gv      = 0x01   /* External clock on XTALHF1 pin */
} CLKCTRL_SELHF_values_t;

/* External Source Select bit group configurations*/
typedef enum CLKCTRL_SELHF_enum
{
    CLKCTRL_SELHF_XTAL_gc          = (CLKCTRL_SELHF_XTAL_gv << CLKCTRL_SELHF_bp),  /* External Crystal */
    CLKCTRL_SELHF_EXTCLOCK_gc      = (CLKCTRL_SELHF_EXTCLOCK_gv << CLKCTRL_SELHF_bp)   /* External clock on XTALHF1 pin */
} CLKCTRL_SELHF_t;

/* Source select bit group values */
typedef enum CLKCTRL_SOURCE_VALUES_enum
{
    CLKCTRL_SOURCE_OSCHF_gv        = 0x00,  /* High frequency internal oscillator as PLL source */
    CLKCTRL_SOURCE_XOSCHF_gv       = 0x01   /* High frequency external clock or external high frequency oscillator as PLL source */
} CLKCTRL_SOURCE_values_t;

